xml/request/libraryRulesRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/openagency">
   <soapenv:Header/>
   <soapenv:Body>
      <open:libraryRulesRequest>
         <!--Optional:-->
         <open:authentication>
            <open:groupIdAut>?</open:groupIdAut>
            <open:passwordAut>?</open:passwordAut>
            <open:userIdAut>?</open:userIdAut>
         </open:authentication>
         <!--You have a CHOICE of the next 2 items at this level-->
         <!--Optional:-->
         <open:agencyId>?</open:agencyId>
         <!--Zero or more repetitions:-->
         <open:libraryRule>
            <open:name>?</open:name>
            <!--You have a CHOICE of the next 2 items at this level-->
            <open:bool>?</open:bool>
            <open:string>?</open:string>
         </open:libraryRule>
         <!--Optional:-->
         <open:callback>?</open:callback>
         <!--Optional:-->
         <open:outputType>?</open:outputType>
         <!--Optional:-->
         <open:trackingId>?</open:trackingId>
      </open:libraryRulesRequest>
   </soapenv:Body>
</soapenv:Envelope>
